# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Text-based window manager and terminal multiplexer
brew "byobu"
# Pack, ship and run any application as a lightweight container
brew "docker"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Text-based web browser
brew "lynx"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Automated testing for Ansible roles
brew "molecule"
# CLI for Todoist
brew "todoist-cli"
# Simple terminal image viewer written in Rust
brew "viu"
# Homebrew, but with Docker images
brew "whalebrew"
