tap "buo/cask-upgrade" # for `brew cu` command
tap "gromgit/fuse" # for sshfs-mac
tap "homebrew/cask-fonts" # for font installation
tap "homebrew/cask-versions" # for beta fomulae
# Automate deployment, configuration, and upgrading
brew "ansible"
# Automatic configure script builder
brew "autoconf" # for asdf-erlang, asdf-php
# Tool for generating GNU Standards-compliant Makefiles
brew "automake" # for asdf-php
# Parser generator
brew "bison" # for asdf-php
# Text-based window manager and terminal multiplexer
brew "byobu"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# XSL-FO print formatter for making PDF or PS documents
brew "fop" # for asdf-erlang
# Software library to render fonts
brew "freetype" # for asdf-php
# Graphics library to dynamically manipulate images
brew "gd" # for asdf-php
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext" # for asdf-php
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU multiple precision arithmetic library
brew "gmp" # for asdf-php
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c" # for asdf-php
# Tools and libraries to manipulate images in many formats
brew "imagemagick" # for asdf-php
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Easy building and installing of Erlang/OTP instances
brew "kerl" # for asdf-erlang
# Network authentication protocol
brew "krb5" # for asdf-php
# BSD-style licensed readline alternative
brew "libedit" # for asdf-php
# Conversion library
brew "libiconv" # for asdf-php
# Image manipulation library
brew "libjpeg" # for asdf-php
# Library for manipulating PNG images
brew "libpng" # for asdf-php
# NaCl networking and cryptography library
brew "libsodium" # for asdf-php
# GNOME XML library
brew "libxml2" # for asdf-php
# C XSLT library for GNOME
brew "libxslt" # for asdf-erlang
# C library for reading, creating, and modifying zip archives
brew "libzip" # for asdf-php
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Automated testing for Ansible roles
brew "molecule"
# Fast, highly customisable system info script
brew "neofetch"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1" # for asdf-erlang, asdf-php
brew "openssl@3" # for asdf-erlang, asdf-php
# Manage compile and link flags for libraries
brew "pkg-config" # for ansible, asdf-php
# Generate C-based recognizers from regular expressions
brew "re2c" # for asdf-php
# Library for command-line editing
brew "readline" # for asdf-erlang
# Command-line interface for SQLite
brew "sqlite" # for ansible
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Cross-platform C++ GUI toolkit
brew "wxwidgets" # for asdf-erlang
# General-purpose lossless data-compression library
brew "zlib" # for asdf-php
# File system client based on SSH File Transfer Protocol
brew "gromgit/fuse/sshfs-mac", link: false
# Tools for building Android applications
cask "android-studio"
# E-books management software
cask "calibre"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Developer platform
cask "dotnet"
# Web browser
cask "firefox"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen-nerd"
# Ricty Diminished
cask "font-ricty-diminished"
# GIT client
cask "fork"
# GNU compiler collection
cask "gfortran" # part of gcc
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Japanese input software
cask "google-japanese-ime"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Android USB tethering driver
cask "horndis"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Animated screen capture application
cask "licecap"
# File system integration
cask "macfuse"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Minimal installer for conda
cask "miniconda"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk"
# App to write, plan, collaborate, and get organised
cask "notion"
# Command-line shell and scripting language
cask "powershell"
# Flexible software sketchbook and a language for learning how to code
cask "processing"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# To-do list
cask "todoist"
# Management tool for Unity
cask "unity-hub"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Resources for Wacom tablets
cask "wacom-tablet"
# Mind mapping and brainstorming tool
cask "xmind"
mas "Kindle", id: 302584613
mas "LimeChat", id: 414030210
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Steam Link", id: 1246969117
mas "Xcode", id: 497799835
vscode "actboy168.lua-debug"
vscode "bdavs.expect"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.vscode-fish"
vscode "casualjim.theme-desertex"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "eiminsasete.apacheconf-snippets"
vscode "electrotype.windows-explorer-context-menu"
vscode "eliverlara.andromeda"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "evilz.vscode-reveal"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "geeklearningio.graphviz-markdown-preview"
vscode "george-alisson.html-preview-vscode"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "idleberg.badges"
vscode "jakebecker.elixir-ls"
vscode "jebbs.plantuml"
vscode "jinsihou.diff-tool"
vscode "joaompinto.vscode-graphviz"
vscode "justusadam.language-haskell"
vscode "kenhowardpdx.vscode-gist"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kukushi.pasteurl"
vscode "l13rary.l13-diff"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mitchdenny.ecdc"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nickdemayo.vscode-json-editor"
vscode "nimsaem.nimvscode"
vscode "oderwat.indent-rainbow"
vscode "pkief.markdown-checkbox"
vscode "pranaygp.vscode-css-peek"
vscode "rafaelmaiolla.diff"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "ryu1kn.partial-diff"
vscode "shardulm94.trailing-spaces"
vscode "shuworks.vscode-table-formatter"
vscode "sirtobi.code-clip-ring"
vscode "sysoev.language-stylus"
vscode "tamasfe.even-better-toml"
vscode "thisismanta.stylus-supremacy"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tomoki1207.pdf"
vscode "tomoki1207.vscode-input-sequence"
vscode "tyriar.sort-lines"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "yzane.markdown-pdf"
vscode "zxh404.vscode-proto3"
