# Cryptographic recipes and primitives for Python
brew "cryptography"
# NaCl networking and cryptography library
brew "libsodium"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Library for manipulating PNG images
brew "libpng"
# Automatic configure script builder
brew "autoconf" # for asdf-erlang, asdf-php
# Tool for generating GNU Standards-compliant Makefiles
brew "automake" # for asdf-php
# Parser generator
brew "bison" # for asdf-php
# GNU multiple precision arithmetic library
brew "gmp" # for asdf-php
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext" # for asdf-php
# Text-based window manager and terminal multiplexer
brew "byobu"
# Software library to render fonts
brew "freetype" # for asdf-php
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77" # for asdf-php
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# XSL-FO print formatter for making PDF or PS documents
brew "fop" # for asdf-erlang
# GNU compiler collection
brew "gcc" # part of gcc
# Graphics library to dynamically manipulate images
brew "gd" # for asdf-php
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# C/C++ seam carving library
brew "liblqr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick" # for asdf-php
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Image manipulation library
brew "jpeg" # for asdf-php
# Easy building and installing of Erlang/OTP instances
brew "kerl" # for asdf-erlang
# Network authentication protocol
brew "krb5" # for asdf-php
# BSD-style licensed readline alternative
brew "libedit" # for asdf-php
# Conversion library
brew "libiconv" # for asdf-php
# GNOME XML library
brew "libxml2" # for asdf-php
# C XSLT library for GNOME
brew "libxslt" # for asdf-erlang
# C library for reading, creating, and modifying zip archives
brew "libzip" # for asdf-php
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Automated testing for Ansible roles
brew "molecule"
# Regular expressions library
brew "oniguruma" # for asdf-php
# Package compiler and linker metadata toolkit
brew "pkgconf" # for ansible, asdf-php, asdf-erlang
# Generate C-based recognizers from regular expressions
brew "re2c" # for asdf-php
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# CLI for Todoist
brew "todoist-cli"
# Simple terminal image viewer written in Rust
brew "viu"
# Cross-platform C++ GUI toolkit
brew "wxwidgets" # for asdf-erlang
# General-purpose lossless data-compression library
brew "zlib" # for asdf-php
